In [1]:
import pandas as pd

Импортируем данные

In [2]:
new_df = []
new_df = pd.DataFrame(new_df)
date = 1971
for i in range(1, 25):
    file = f'pogoda_31.12.{date}.xlsx'
    xl = pd.ExcelFile(file)
    data1 = xl.parse(f'31.12.{date}')
    date = date + 2
    
    new_df = pd.concat([new_df, data1])

In [3]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17144 entries, 0 to 724
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  17144 non-null  int64
 1   date        17144 non-null  object
 2   max         17143 non-null  float64
 3   min         17101 non-null  float64
 4   average     17144 non-null  float64
 5   atm         4480 non-null   float64
 6   wind        17143 non-null  float64
 7   rain        17117 non-null  float64
 8   effect_t    17071 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 1.3+ MB

In [4]:
df = new_df

In [5]:
df['date'] = pd.to_datetime(df['date'])

In [6]:
df.head()

   Unnamed: 0       date  max  min  average  atm  wind  rain  effect_t
0           0 1973-01-01  3.0 -3.0     -0.3  NaN   2.0   0.0      -3.2
1           1 1973-02-01  3.0 -3.0     -0.3  NaN   1.0   0.0      -2.5
2           2 1973-03-01  6.0 -4.0     -0.2  NaN   2.0   0.0      -3.1
3           3 1973-04-01  4.0 -1.0      0.9  NaN   2.0   0.0      -1.8
4           4 1973-05-01  1.0  0.0      0.7  NaN   2.0   0.0      -2.1

In [7]:
df = df.drop('Unnamed: 0', axis = 1)

Удалим дубликаты, отсортируем

In [8]:
print(df.duplicated().sum())

22

In [9]:
df.drop_duplicates(inplace = True)

In [10]:
df.sort_values(by = 'date', inplace = True)

In [11]:
df.head()

          date   max   min  average  atm  wind  rain  effect_t
0   1973-01-01   3.0  -3.0     -0.3  NaN   2.0   0.0      -3.2
31  1973-01-02   9.0   0.0      4.7  NaN   2.0   1.0       2.3
59  1973-01-03  15.0  -3.0      4.8  NaN   3.0   0.0       1.5
90  1973-01-04  15.0   0.0      7.8  NaN   2.0   0.0       5.7
120 1973-01-05  23.0  13.0     16.2  NaN   4.0   1.0      14.6

Добавим две переменные: месяц и год

In [12]:
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17122 entries, 0 to 724
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      17122 non-null  datetime64[ns]
 1   max       17121 non-null  float64
 2   min       17079 non-null  float64
 3   average   17122 non-null  float64
 4   atm       4473 non-null   float64
 5   wind      17121 non-null  float64
 6   rain      17095 non-null  float64
 7   effect_t  17049 non-null  float64
 8   year      17122 non-null  int64
 9   month     17122 non-null  int64
dtypes: datetime64[ns](1), float64(7), int64(2)
memory usage: 1.4 MB

In [18]:
df.head()

        date   max   min  average  wind  rain  effect_t  year  month
0 1973-01-01   3.0  -3.0     -0.3   2.0   0.0      -3.2  1973      1
1 1973-01-02   9.0   0.0      4.7   2.0   1.0       2.3  1973      1
2 1973-01-03  15.0  -3.0      4.8   3.0   0.0       1.5  1973      1
3 1973-01-04  15.0   0.0      7.8   2.0   0.0       5.7  1973      1
4 1973-01-05  23.0  13.0     16.2   4.0   1.0      14.6  1973      1

In [15]:
df.reset_index(inplace = True)

In [17]:
df.drop(['index', 'atm'], axis = 1, inplace = True)

In [20]:
df.to_excel('wine_data.xlsx', sheet_name = 'Sheet1')